sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
/***********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher
    
    ---------------------------------------------------------------------
    File:      kinetis_uart_pins.h
    Project:   Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2020
    *********************************************************************
    07.01.2019 Add return value to fnConfigureUARTpin() and handle UART_RTS_RS485_MANUAL_MODE case when channel operated in manual RS485 mode
    09.01.2019 Shared with iMX project
    09.03.2019 Add error handling to devices with independent error interrupt {1}
    22.11.2019 Add complete KE15 LPUART RX/TX mux options
    02.01.2020 Add complete K02 UART1 RX/TX mux options
    30.10.2020 UART/LPUART in loop-back mode doesn't configure the UARTx Rx/LPUARTx Rx pin


*/

#if !defined UART_PULL_UPS                                               // if the user wishes pull-up/downs on the UART Rx pins this can be set to PORT_PS_UP_ENABLE or PORT_PS_DOWN_ENABLE in app_hw_kinetis.h
    #define UART_PULL_UPS    (PORT_NO_PULL)                              // if not overridden by the user there are no pull-up/downs on the UART Rx pins
#endif


static int fnConfigureUARTpin(QUEUE_HANDLE Channel, int iPinReference)
{
    int iInterruptID = 0;
    unsigned char ucPriority = 0;
    void (*InterruptFunc)(void) = 0;
    #if defined UART_ERROR_INTERRUPT_VECTOR                              // {1}
    void (*InterruptErrorFunc)(void) = 0;
    unsigned char ucErrorPriority = 0;
    #endif
    switch (Channel) {
    #if defined FIRST_LPUART_CHANNEL
    case FIRST_LPUART_CHANNEL:
        switch (iPinReference) {
        case LPUART_TX_PIN:                                              // LPUART0 tx pin configuration
        #if defined _iMX
            #if defined iMX_RT1011
            IOMUXC_LPUART1_TXD_SELECT_INPUT = IOMUXC_LPUART1_TXD_SELECT_INPUT_GPIO_10_ALT0; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_10, LPUART1_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART1 Tx on GPIO1-10  - alt function 0 [iMX LPUARTs count 1..8]
            #elif defined iMX_RT105X || defined iMX_RT106X
            _CONFIG_PERIPHERAL(GPIO_AD_B0_12, LPUART1_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART1 Tx on GPIO1-12 - alt function 2 [iMX LPUARTs count 1..8]
            #else
            _CONFIG_PERIPHERAL(GPIO_AD_B0_06, LPUART1_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART1 Tx on GPIO1-06 - alt function 2 [iMX LPUARTs count 1..8]
            #endif
        #elif defined KINETIS_KE15
            #if defined LPUART0_ON_B
            _CONFIG_PERIPHERAL(B, 1, (PB_1_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PB1 (alt. function 2)
            #elif defined LPUART0_ON_A_HIGH
            _CONFIG_PERIPHERAL(A, 10, (PA_10_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PA10 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(A, 3, (PA_3_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PA3 (alt. function 6)
            #endif
        #elif defined KINETIS_K27 || defined KINETIS_K28
            _CONFIG_PERIPHERAL(C, 24, (PC_24_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PC24 (alt. function 3)
        #elif defined KINETIS_KL03
            #if defined LPUART0_ON_A
            _CONFIG_PERIPHERAL(A, 3, (PA_3_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PA3 (alt. function 4)
            #elif defined LPUART0_ON_B_HIGH
            _CONFIG_PERIPHERAL(B, 3, (PB_3_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PB2 (alt. function 3)
            #elif defined LPUART0_ON_B_ALT
            _CONFIG_PERIPHERAL(B, 2, (PB_2_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PB2 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(B, 1, (PB_1_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PB1 (alt. function 2)
            #endif
        #elif defined KINETIS_K65 || defined KINETIS_K66
            #if defined LPUART0_ON_D
            _CONFIG_PERIPHERAL(D, 9, (PD_9_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PD9 (alt. function 5)
            #elif defined LPUART0_ON_A
            _CONFIG_PERIPHERAL(A, 2, (PA_2_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PA2 (alt. function 5)
            #else
            _CONFIG_PERIPHERAL(E, 8, (PE_8_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PE8 (alt. function 5)
            #endif
        #elif defined KINETIS_KL43 || defined KINETIS_KL33 || defined KINETIS_KL17 || defined KINETIS_KL27 || defined KINETIS_KL28 || defined KINETIS_KL82 || defined KINETIS_K80 || defined KINETIS_K32L2A || defined KINETIS_K32L2B
            #if !defined KINETIS_K80 && defined LPUART0_ON_E
            _CONFIG_PERIPHERAL(E, 20, (PE_20_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PE20 (alt. function 4)
            #elif (defined KINETIS_KL43 || defined KINETIS_KL33) && defined LPUART0_ON_D
            _CONFIG_PERIPHERAL(D, 7, (PD_7_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PD7 (alt. function 3)
            #elif defined LPUART0_ON_B
            _CONFIG_PERIPHERAL(B, 17, (PB_17_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PB17 (alt. function 3)
            #elif defined LPUART0_ON_A_HIGH && (defined KINETIS_K80 || defined KINETIS_KL28 || defined KINETIS_K32L2A)
            _CONFIG_PERIPHERAL(A, 14, (PA_14_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PA14 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(A, 2, (PA_2_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PA2 (alt. function 2)
            #endif
        #else                                                            // K22, KV31
            #if defined LPUART0_ON_E
            _CONFIG_PERIPHERAL(E, 4, (PE_4_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PE4 (alt. function 3)
            #elif defined LPUART0_ON_B
            _CONFIG_PERIPHERAL(B, 11, (PB_11_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PB11 (alt. function 3)
            #elif defined LPUART0_ON_D_HIGH && defined KINETIS_K22
            _CONFIG_PERIPHERAL(D, 9, (PD_9_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PD9 (alt. function 5)
            #elif defined LPUART0_ON_D_LOW
            _CONFIG_PERIPHERAL(D, 3, (PD_3_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PD3 (alt. function 6)
            #elif defined LPUART0_ON_C_HIGH
            _CONFIG_PERIPHERAL(C, 17, (PC_17_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PC17 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(C, 4, (PC_4_LPUART0_TX | UART_PULL_UPS)); // LPUART0_TX on PC4 (alt. function 7)
            #endif
        #endif
        #if defined irq_LPUART0_TX_ID
            iInterruptID = irq_LPUART0_TX_ID;                            // LPUART0 transmitter has unique interrupt vector
        #else
            iInterruptID = irq_LPUART0_ID;                               // LPUART0 transmitter shares interrupt vector with receiver
        #endif
            ucPriority = PRIORITY_LPUART0;
            InterruptFunc = _LPSCI0_Interrupt;
            break;

        case LPUART_RX_PIN:                                              // LPUART0 rx pin configuration
        #if defined irq_LPUART0_RX_ID
            iInterruptID = irq_LPUART0_RX_ID;                            // LPUART0 receiver has unique interrupt vector
        #else
            iInterruptID = irq_LPUART0_ID;                               // LPUART0 receiver shares interrupt vector with transmitter
        #endif
            ucPriority = PRIORITY_LPUART0;
            InterruptFunc = _LPSCI0_Interrupt;
            if ((LPUART0_CTRL & LPUART_CTRL_LOOPS) != 0) {               // loop-back/single-wire mode doesn't configure/use the LPUARTx_Rx pin
                break;
            }
        #if defined _iMX
            #if defined iMX_RT1011
            IOMUXC_LPUART1_RXD_SELECT_INPUT = IOMUXC_LPUART1_RXD_SELECT_INPUT_GPIO_09_ALT0; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_09, LPUART1_RXD, UART_PULL_UPS);     // select LPUART1 Rx on GPIO1-09    alt. function 0 [iMX LPUARTs count 1..8]
            #elif defined iMX_RT105X || defined iMX_RT106X
            _CONFIG_PERIPHERAL(GPIO_AD_B0_13, LPUART1_RX, UART_PULL_UPS);// select LPUART1 Rx on GPIO1-13 alt. function 2 [iMX LPUARTs count 1..8]
            #else
            _CONFIG_PERIPHERAL(GPIO_AD_B0_07, LPUART1_RX, UART_PULL_UPS);// select LPUART1 Rx on GPIO1-07 alt. function 2 [iMX LPUARTs count 1..8]
            #endif
        #elif defined KINETIS_KE15
            #if defined LPUART0_ON_B
            _CONFIG_PERIPHERAL(B, 0, (PB_0_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PB0 (alt. function 2)
            #elif defined LPUART0_ON_A_HIGH
            _CONFIG_PERIPHERAL(A, 11, (PA_11_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PA11 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(A, 2, (PA_2_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PA2 (alt. function 6)
            #endif
        #elif defined KINETIS_K27 || defined KINETIS_K28
            _CONFIG_PERIPHERAL(C, 25, (PC_25_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PC25 (alt. function 3)
        #elif defined KINETIS_KL03
            #if defined LPUART0_ON_A
            _CONFIG_PERIPHERAL(A, 4, (PA_4_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PA4 (alt. function 4)
            #elif defined LPUART0_ON_B_HIGH && !defined LPUART_OPTION_1
            _CONFIG_PERIPHERAL(B, 4, (PB_4_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PB4 (alt. function 3)
            #elif defined LPUART0_ON_B_ALT
            _CONFIG_PERIPHERAL(B, 1, (PB_1_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PB1 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(B, 2, (PB_2_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PB2 (alt. function 2)
            #endif
        #elif defined KINETIS_K65 || defined KINETIS_K66
            #if defined LPUART0_ON_D
            _CONFIG_PERIPHERAL(D, 8, (PD_8_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PD8 (alt. function 5)
            #elif defined LPUART0_ON_A
            _CONFIG_PERIPHERAL(A, 1, (PA_1_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PA1 (alt. function 5)
            #else
            _CONFIG_PERIPHERAL(E, 9, (PE_9_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PE9 (alt. function 5)
            #endif
        #elif defined KINETIS_KL17 || defined KINETIS_KL27 || defined KINETIS_KL28 || defined KINETIS_KL33 || defined KINETIS_KL43 || defined KINETIS_KL82 || defined KINETIS_K80 || defined KINETIS_K32L2A || defined KINETIS_K32L2B
            #if !defined KINETIS_K80 && defined LPUART0_ON_E
            _CONFIG_PERIPHERAL(E, 21, (PE_21_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PE21 (alt. function 4)
            #elif (defined KINETIS_KL43 || defined KINETIS_KL33 || defined KINETIS_KL28 || defined KINETIS_K80 || defined KINETIS_K32L2A) && defined LPUART0_ON_D
            _CONFIG_PERIPHERAL(D, 6, (PD_6_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PD6 (alt. function 3)
            #elif defined LPUART0_ON_B
            _CONFIG_PERIPHERAL(B, 16, (PB_16_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PB16 (alt. function 3)
            #elif defined LPUART0_ON_A_HIGH && (defined KINETIS_K80 || defined KINETIS_KL28 || defined KINETIS_K32L2A)
            _CONFIG_PERIPHERAL(A, 15, (PA_15_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PA15 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(A, 1, (PA_1_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PA1 (alt. function 2)
            #endif
        #else                                                            // K22, KV31
            #if defined LPUART0_ON_E
            _CONFIG_PERIPHERAL(E, 5, (PE_5_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PE5 (alt. function 3)
            #elif defined LPUART0_ON_B
            _CONFIG_PERIPHERAL(B, 10, (PB_10_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PB10 (alt. function 3)
            #elif defined LPUART0_ON_D_HIGH && defined KINETIS_K22
            _CONFIG_PERIPHERAL(D, 8, (PD_8_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PD8 (alt. function 5)
            #elif defined LPUART0_ON_D_LOW
            _CONFIG_PERIPHERAL(D, 2, (PD_2_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PD2 (alt. function 6)
            #elif defined LPUART0_ON_C_HIGH
            _CONFIG_PERIPHERAL(C, 16, (PC_16_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PC16 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(C, 3, (PC_3_LPUART0_RX | UART_PULL_UPS)); // LPUART0_RX on PC3 (alt. function 7)
            #endif
        #endif
            break;

        #if defined SUPPORT_HW_FLOW
        case LPUART_CTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_CTS_CONTROL // use GPIO interrupt
            _EXCEPTION("To do");
            #else                                                        // use dedicated CTS line
                #if defined _iMX && defined iMX_RT106X
            _CONFIG_PERIPHERAL(GPIO_AD_B0_14, LPUART1_CTS_B, UART_PULL_UPS); // select LPUART1 CTS on GPIO1-14 - alt function 2 [iMX LPUARTs count 1..8]
                #else
            _EXCEPTION("To do");
                #endif
            #endif
            break;
            #if defined LPUART0_MANUAL_RTS_CONTROL
        case UART_RTS_RS485_MANUAL_MODE:
            return 1;                                                    // this UART's RTS line is manually controlled in RS485 mode
            #endif
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_RTS_CONTROL
        case LPUART_RTS_PIN_ASSERT:
            if (ucRTS_neg[FIRST_LPUART_CHANNEL] == 0) {
                _SET_LPRTS_0_HIGH();
            }
            else {
                _SET_LPRTS_0_LOW();
            }
            break;
        case LPUART_RTS_PIN_NEGATE:
            if (ucRTS_neg[FIRST_LPUART_CHANNEL] == 0) {
                _SET_LPRTS_0_LOW();
            }
            else {
                _SET_LPRTS_0_HIGH();
            }
            break;
            #endif

        case LPUART_RTS_PIN_INVERTED:
        case LPUART_RTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_RTS_CONTROL
            if (iPinReference != LPUART_RTS_PIN_INVERTED) {
                _CONFIGURE_LPRTS_0_LOW();                                // configure RTS output and set to '0'
                ucRTS_neg[FIRST_LPUART_CHANNEL] = 0;                     // not inverted RTS mode
            }
            else {
                _CONFIGURE_LPRTS_0_HIGH();                               // configure RTS output and set to '1'
                ucRTS_neg[FIRST_LPUART_CHANNEL] = 1;                     // inverted RTS mode
            }
            #elif defined _iMX
                #if defined iMX_RT1011
            _CONFIG_PERIPHERAL(GPIO_07, LPUART1_RTS_B, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART1 RTS on GPIO1-07 [iMX LPUARTs count 1..8]
                #elif defined iMX_RT105X || defined iMX_RT106X
            _CONFIG_PERIPHERAL(GPIO_AD_B0_15, LPUART1_RTS_B, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART1 RTS on GPIO1-15 [iMX LPUARTs count 1..8]
                #else
            _CONFIG_PERIPHERAL(GPIO_AD_B0_09, LPUART1_RTS_B, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART1 RTS on GPIO1-09 [iMX LPUARTs count 1..8]
                #endif
            #elif defined KINETIS_K65 || defined KINETIS_K66
                #if defined LPUART0_ON_D
            _CONFIG_PERIPHERAL(D, 10, (PD_10_LPUART0_RTS));              // LPUART0_RTS on PD10 (alt. function 5)
                #elif defined LPUART0_ON_A
            _CONFIG_PERIPHERAL(A, 3, (PA_3_LPUART0_RTS));                // LPUART0_RTS on PA3 (alt. function 5)
                #else
            _CONFIG_PERIPHERAL(E, 11, (PE_11_LPUART0_RTS));              // LPUART0_RTS on PE11 (alt. function 5)
                #endif
            #elif defined KINETIS_KE15
            _CONFIG_PERIPHERAL(C, 9, (PC_9_LPUART0_RTS));                // LPUART0_RTS on PC9 (alt. function 6)
            #endif
            break;
        #endif
        }
        break;
    #endif

