sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
    #if defined SECOND_LPUART_CHANNEL
    case SECOND_LPUART_CHANNEL:
        switch (iPinReference) {
        case LPUART_TX_PIN:                                              // LPUART1 tx pin configuration
        #if defined _iMX
            #if defined iMX_RT1011
            IOMUXC_LPUART2_TXD_SELECT_INPUT = IOMUXC_LPUART2_TXD_SELECT_INPUT_GPIO_AD_00_ALT0; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_00, LPUART2_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART2 Tx on GPIO1-14  - alt function 0 [iMX LPUARTs count 1..8]
            #elif defined iMX_RT1015
            IOMUXC_LPUART2_TX_SELECT_INPUT = IOMUXC_LPUART2_TX_SELECT_INPUT_GPIO_EMC_22_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_22, LPUART2_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART2 Tx on GPIO2-22 - alt function 2 [iMX LPUARTs count 1..8]
            #elif defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART2_TX_SELECT_INPUT = IOMUXC_LPUART2_TX_SELECT_INPUT_GPIO_AD_B1_02_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_02, LPUART2_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART2 Tx on GPIO1-18 - alt function 2 [iMX LPUARTs count 1..8]
            #else
                #if defined LPUART2_ON_EMC
            IOMUXC_LPUART2_TX_SELECT_INPUT = IOMUXC_LPUART2_TX_SELECT_INPUT_GPIO_EMC_22_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_22, LPUART2_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART2 Tx on pad GPIO_EMC_22 on GPIO2-22 - alt function 2 [iMX LPUARTs count 1..8]
                #else
            IOMUXC_LPUART2_TX_SELECT_INPUT = IOMUXC_LPUART2_TX_SELECT_INPUT_GPIO_AD_B1_08_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_08, LPUART2_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART2 Tx on pad GPIO_AD_B1_08 on GPIO1-24 - alt function 2 [iMX LPUARTs count 1..8]
                #endif
            #endif
        #elif defined KINETIS_KL17 || defined KINETIS_KL27 || defined KINETIS_KL28 || defined KINETIS_KL33 || defined KINETIS_KL43 || defined KINETIS_K80 || defined KINETIS_K32L2A || defined KINETIS_K32L2B
            #if defined LPUART1_ON_E
            _CONFIG_PERIPHERAL(E, 0, (PE_0_LPUART1_TX | UART_PULL_UPS)); // LPUART1_TX on PE0 (alt. function 3)
            #elif defined LPUART1_ON_C
            _CONFIG_PERIPHERAL(C, 4, (PC_4_LPUART1_TX | UART_PULL_UPS)); // LPUART1_TX on PC4 (alt. function 3)
            #elif !defined KINETIS_K80
            _CONFIG_PERIPHERAL(A, 19, (PA_19_LPUART1_TX | UART_PULL_UPS)); // LPUART1_TX on PA19 (alt. function 3)
            #endif
        #elif defined KINETIS_KE15
            #if defined LPUART1_ON_C_HIGH
            _CONFIG_PERIPHERAL(C, 9, (PC_9_LPUART1_TX | UART_PULL_UPS)); // LPUART1_TX on PC9 (alt. function 2)
            #else
            _CONFIG_PERIPHERAL(C, 7, (PC_7_LPUART1_TX | UART_PULL_UPS)); // LPUART1_TX on PC7 (alt. function 2)
            #endif
        #endif
        #if defined irq_LPUART1_TX_ID
            iInterruptID = irq_LPUART1_TX_ID;                            // LPUART1 transmitter has a unique vector
        #elif defined irq_LPUART1_ID
            iInterruptID = irq_LPUART1_ID;                               // LPUART1 transmitter shares interrupt vector with receiver
        #else
            iInterruptID = irq_LPUART0_ID;                               // LPUART1 shares interrupt vector with LPUART0
        #endif
            ucPriority = PRIORITY_LPUART1;
            InterruptFunc = _LPSCI1_Interrupt;
            break;
        case LPUART_RX_PIN:                                              // LPUART1 rx pin configuration
        #if defined irq_LPUART1_RX_ID
            iInterruptID = irq_LPUART1_RX_ID;                            // LPUART1 receiver has unique interrupt vector
        #elif defined irq_LPUART1_ID
            iInterruptID = irq_LPUART1_ID;                               // LPUART1 receiver shares interrupt vector with transmitter
        #else
            iInterruptID = irq_LPUART0_ID;                               // LPUART1 shares interrupt vector with LPUART0
        #endif
            ucPriority = PRIORITY_LPUART1;
            InterruptFunc = _LPSCI1_Interrupt;
            if ((LPUART1_CTRL & LPUART_CTRL_LOOPS) != 0) {               // loop-back/single-wire mode doesn't configure/use the LPUARTx_Rx pin
                break;
            }
        #if defined _iMX
            #if defined iMX_RT1011
            IOMUXC_LPUART2_RXD_SELECT_INPUT = IOMUXC_LPUART2_RXD_SELECT_INPUT_GPIO_13_ALT0; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_13, LPUART2_RXD, UART_PULL_UPS);     // select LPUART2 Rx on GPIO1-13    alt. function 0 [iMX LPUARTs count 1..8]
            #elif defined iMX_RT1015
            IOMUXC_LPUART2_RX_SELECT_INPUT = IOMUXC_LPUART2_RX_SELECT_INPUT_GPIO_EMC_23_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_23, LPUART2_RX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART2 Rx on GPIO2-23 - alt function 2 [iMX LPUARTs count 1..8]
            #elif defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART2_RX_SELECT_INPUT = IOMUXC_LPUART2_RX_SELECT_INPUT_GPIO_AD_B1_03_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_03, LPUART2_RX, UART_PULL_UPS); // select LPUART2 Rx on GPIO1-19 - alt function 2 [iMX LPUARTs count 1..8]
            #else
                #if defined LPUART2_ON_EMC
            IOMUXC_LPUART2_RX_SELECT_INPUT = IOMUXC_LPUART2_RX_SELECT_INPUT_GPIO_EMC_23_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_23, LPUART2_RX, UART_PULL_UPS);  // select LPUART2 Rx on GPIO2-23 - alt function 2 [iMX LPUARTs count 1..8]
                #else
            IOMUXC_LPUART2_RX_SELECT_INPUT = IOMUXC_LPUART2_RX_SELECT_INPUT_GPIO_AD_B1_09_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_09, LPUART2_RX, UART_PULL_UPS);// select LPUART2 Rx on GPIO1-25 - alt function 2 [iMX LPUARTs count 1..8]
                #endif
            #endif
        #elif defined KINETIS_KL17 || defined KINETIS_KL27 || defined KINETIS_KL28 || defined KINETIS_KL33 || defined KINETIS_KL43 || defined KINETIS_K80 || defined KINETIS_K32L2A || defined KINETIS_K32L2B
            #if defined LPUART1_ON_E
            _CONFIG_PERIPHERAL(E, 1, (PE_1_LPUART1_RX | UART_PULL_UPS)); // LPUART1_RX on PE1 (alt. function 3)
            #elif defined LPUART1_ON_C
            _CONFIG_PERIPHERAL(C, 3, (PC_3_LPUART1_RX | UART_PULL_UPS)); // LPUART1_RX on PC3 (alt. function 3)
            #elif !defined KINETIS_K80
            _CONFIG_PERIPHERAL(A, 18, (PA_18_LPUART1_RX | UART_PULL_UPS)); // LPUART1_RX on PA18 (alt. function 3)
            #endif
        #elif defined KINETIS_KE15
            #if defined LPUART1_ON_C_HIGH
            _CONFIG_PERIPHERAL(C, 8, (PC_8_LPUART1_RX | UART_PULL_UPS)); // LPUART1_RX on PC8 (alt. function 2)
            #else
            _CONFIG_PERIPHERAL(C, 6, (PC_6_LPUART1_RX | UART_PULL_UPS)); // LPUART1_RX on PC6 (alt. function 2)
            #endif
        #endif
            break;
        #if defined SUPPORT_HW_FLOW
        case LPUART_CTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_CTS_CONTROL // use GPIO interrupt
            _EXCEPTION("To do");
            #else                                                        // use dedicated CTS line
            _EXCEPTION("To do");
            #endif
            break;
        case LPUART_RTS_PIN:
            #if defined _iMX
                #if defined iMX_RT1011 || defined iMX_RT1015
            _EXCEPTION("To do");
                #elif defined iMX_RT105X || defined iMX_RT106X
            _CONFIG_PERIPHERAL(GPIO_AD_B1_01, LPUART2_RTS_B, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART2 RTS on GPIO1-17 [iMX LPUARTs count 1..8]
                #else
            _CONFIG_PERIPHERAL(GPIO_AD_B1_07, LPUART2_RTS_B, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART2 RTS on GPIO1-25 [iMX LPUARTs count 1..8]
                #endif
            #elif defined KINETIS_KE15
            _CONFIG_PERIPHERAL(E, 6, (PE_6_LPUART1_RTS));                // LPUART1_RTS on PE6 (alt. function 6)
            #endif
            break;
        #endif
        }
        break;
    #endif

