sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
    #if defined THIRD_LPUART_CHANNEL
    case THIRD_LPUART_CHANNEL:
        switch (iPinReference) {
        case LPUART_TX_PIN:                                              // LPUART2 tx pin configuration
            #if defined _iMX
                #if defined iMX_RT1011
            IOMUXC_LPUART3_TXD_SELECT_INPUT = IOMUXC_LPUART3_TXD_SELECT_INPUT_GPIO_12_ALT0; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_12, LPUART3_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART3 Tx on GPIO1-12 alt. function 0 [iMX LPUARTs count 1..8]
                #elif defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART3_TX_SELECT_INPUT = IOMUXC_LPUART3_TX_SELECT_INPUT_GPIO_AD_B1_06_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_06, LPUART3_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART3 Tx on GPIO1-22 - alt function 2 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART3_ON_EMC
            IOMUXC_LPUART3_TX_SELECT_INPUT = IOMUXC_LPUART3_TX_SELECT_INPUT_GPIO_EMC_06_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_06, LPUART3_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART3 Tx on GPIO2-06 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART3_TX_SELECT_INPUT = IOMUXC_LPUART3_TX_SELECT_INPUT_GPIO_AD_B0_14_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B0_14, LPUART3_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART3 Tx on GPIO1-14 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #elif defined KINETIS_KE15
                #if defined LPUART2_ON_D_LOW
            _CONFIG_PERIPHERAL(D, 7, (PD_7_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PD7 (alt. function 2)
                #else
            _CONFIG_PERIPHERAL(E, 12, (PE_12_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PE12 (alt. function 2)
                #endif
            #elif defined KINETIS_KL28 || defined KINETIS_K32L2A
                #if defined LPUART2_ON_E_LOW
            _CONFIG_PERIPHERAL(E, 16, (PE_16_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PE16 (alt. function 3)
                #elif defined LPUART2_ON_E_HIGH
            _CONFIG_PERIPHERAL(E, 22, (PE_22_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PE22 (alt. function 4)
                #elif defined LPUART2_ON_D_LOW
            _CONFIG_PERIPHERAL(D, 3, (PD_3_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PD3 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(D, 5, (PD_5_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PD5 (alt. function 3)
                #endif
            #elif defined KINETIS_K80
                #if defined LPUART2_ON_E_LOW
            _CONFIG_PERIPHERAL(E, 12, (PE_12_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PE12 (alt. function 3)
                #elif defined LPUART2_ON_E_HIGH
            _CONFIG_PERIPHERAL(E, 16, (PE_16_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PE16 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(D, 3, (PD_3_LPUART2_TX | UART_PULL_UPS)); // LPUART2_TX on PD3 (alt. function 3)
                #endif
            #endif
            #if !defined irq_LPUART2_ID && defined INTMUX0_AVAILABLE
            iInterruptID = (irq_INTMUX0_0_ID + INTMUX_LPUART2);          // LPUART2 interrupt vector based on INTMUX
            ucPriority = INTMUX0_PERIPHERAL_LPUART2;
            #elif defined irq_LPUART2_TX_ID
            iInterruptID = irq_LPUART2_TX_ID;                            // LPUART2 transmitter has a unique vector
            ucPriority = PRIORITY_LPUART2;
            #else
            iInterruptID = irq_LPUART2_ID;                               // LPUART2 transmitter shares interrupt vector with receiver
            ucPriority = PRIORITY_LPUART2;
            #endif
            InterruptFunc = _LPSCI2_Interrupt;
            break;
        case LPUART_RX_PIN:                                              // LPUART2 rx pin configuration
            #if !defined irq_LPUART2_ID && defined INTMUX0_AVAILABLE
            iInterruptID = (irq_INTMUX0_0_ID + INTMUX_LPUART2);          // LPUART2 interrupt vector based on INTMUX
            ucPriority = INTMUX0_PERIPHERAL_LPUART2;
            #elif defined irq_LPUART2_RX_ID
            iInterruptID = irq_LPUART2_RX_ID;                            // LPUART2 receiver has a unique vector
            ucPriority = PRIORITY_LPUART2;
            #else
            iInterruptID = irq_LPUART2_ID;                               // LPUART2 receiver shares interrupt vector with transmitter
            ucPriority = PRIORITY_LPUART2;
            #endif
            InterruptFunc = _LPSCI2_Interrupt;
            if ((LPUART2_CTRL & LPUART_CTRL_LOOPS) != 0) {               // loop-back/single-wire mode doesn't configure/use the LPUARTx_Rx pin
                break;
            }
            #if defined _iMX
                #if defined iMX_RT1011
            IOMUXC_LPUART3_RXD_SELECT_INPUT = IOMUXC_LPUART3_RXD_SELECT_INPUT_GPIO_11_ALT0; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_11, LPUART3_RXD, UART_PULL_UPS);     // select LPUART3 Rx on GPIO1-11 - alt. function 0 [iMX LPUARTs count 1..8]
                #elif defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART3_RX_SELECT_INPUT = IOMUXC_LPUART3_RX_SELECT_INPUT_GPIO_AD_B1_07_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_07, LPUART3_RX, UART_PULL_UPS); // select LPUART3 Rx on GPIO1-23 - alt function 2 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART3_ON_EMC
            IOMUXC_LPUART3_RX_SELECT_INPUT = IOMUXC_LPUART3_RX_SELECT_INPUT_GPIO_EMC_07_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_07, LPUART3_RX, UART_PULL_UPS); // select LPUART3 Rx on GPIO2-07 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART3_RX_SELECT_INPUT = IOMUXC_LPUART3_RX_SELECT_INPUT_GPIO_AD_B0_15_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B0_15, LPUART3_RX, UART_PULL_UPS); // select LPUART3 Rx on GPIO1-15 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #elif defined KINETIS_KE15
                #if defined LPUART2_ON_D_LOW
            _CONFIG_PERIPHERAL(D, 6, (PD_6_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PD6 (alt. function 2)
                #else
            _CONFIG_PERIPHERAL(D, 17, (PD_17_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PD17 (alt. function 2)
                #endif
            #elif defined KINETIS_KL28 || defined KINETIS_K32L2A
                #if defined LPUART2_ON_E_LOW
            _CONFIG_PERIPHERAL(E, 17, (PE_17_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PE17 (alt. function 3)
                #elif defined LPUART2_ON_E_HIGH
            _CONFIG_PERIPHERAL(E, 23, (PE_23_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PE23 (alt. function 4)
                #elif defined LPUART2_ON_D_LOW
            _CONFIG_PERIPHERAL(D, 2, (PD_2_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PD2 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(D, 4, (PD_4_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PD4 (alt. function 3)
                #endif
            #elif defined KINETIS_K80
               #if defined LPUART2_ON_E_LOW
            _CONFIG_PERIPHERAL(E, 13, (PE_13_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PE13 (alt. function 3)
                #elif defined LPUART2_ON_E_HIGH
            _CONFIG_PERIPHERAL(E, 17, (PE_17_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PE17 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(D, 2, (PD_2_LPUART2_RX | UART_PULL_UPS)); // LPUART2_RX on PD2 (alt. function 3)
                #endif
            #endif
            break;
        #if defined SUPPORT_HW_FLOW
        case LPUART_CTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_CTS_CONTROL // use GPIO interrupt
            _EXCEPTION("To do");
            #else                                                        // use dedicated CTS line
            _EXCEPTION("To do");
            #endif
            break;
        case LPUART_RTS_PIN:
            #if defined _iMX
                #if defined iMX_RT1011 || defined iMX_RT1015
            _EXCEPTION("To do");
                #elif defined iMX_RT105X || defined iMX_RT106X
            _CONFIG_PERIPHERAL(GPIO_AD_B1_05, LPUART3_RTS_B, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART3 RTS on GPIO1-21 [iMX LPUARTs count 1..8]
                #endif
            #elif defined KINETIS_KE15
            _CONFIG_PERIPHERAL(D, 12, (PD_12_LPUART2_RTS));              // LPUART2_RTS on PD12 (alt. function 6)
            #endif
            break;
        #endif
        }
        break;
    #endif

    #if defined FOURTH_LPUART_CHANNEL
    case FOURTH_LPUART_CHANNEL:
        switch (iPinReference) {
        case LPUART_TX_PIN:                                              // LPUART3 tx pin configuration
            #if defined _iMX
                #if defined iMX_RT1011
            IOMUXC_LPUART4_TXD_SELECT_INPUT = IOMUXC_LPUART4_TXD_SELECT_INPUT_GPIO_06_ALT3; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_06, LPUART4_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Tx on GPIO1-06 - alt. function 3 [iMX LPUARTs count 1..8]
                #elif defined iMX_RT105X || defined iMX_RT106X
                    #if defined UART4_ON_4
            IOMUXC_LPUART4_TX_SELECT_INPUT = IOMUXC_LPUART4_TX_SELECT_INPUT_GPIO_EMC_19_ALT2; // special case to select the pad involved in daisy chain
            CONFIG_PERIPHERAL(GPIO_EMC_19, LPUART4_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Tx on GPIO4-19 - alt function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART4_TX_SELECT_INPUT = IOMUXC_LPUART4_TX_SELECT_INPUT_GPIO_B1_00_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_B1_00, LPUART4_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Tx on GPIO2-16 - alt function 2 [iMX LPUARTs count 1..8]
                    #endif
                #elif defined iMX_RT1015
            IOMUXC_LPUART4_TX_SELECT_INPUT = IOMUXC_LPUART4_TX_SELECT_INPUT_GPIO_EMC_32_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_32, LPUART4_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Tx on GPIO3-00 - alt. function 2 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART3_ON_EMC_LOW
            IOMUXC_LPUART4_TX_SELECT_INPUT = IOMUXC_LPUART4_TX_SELECT_INPUT_GPIO_EMC_02_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_02, LPUART4_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Tx on GPIO2-02 - alt. function 2 [iMX LPUARTs count 1..8]
                    #elif defined LPUART3_ON_EMC_HIGH
            IOMUXC_LPUART4_TX_SELECT_INPUT = IOMUXC_LPUART4_TX_SELECT_INPUT_GPIO_EMC_32_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_32, LPUART4_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Tx on GPIO3-00 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART4_TX_SELECT_INPUT = IOMUXC_LPUART4_TX_SELECT_INPUT_GPIO_AD_B1_10_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_10, LPUART4_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Tx on GPIO1-26 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #elif defined KINETIS_K80
               #if defined LPUART2_ON_E
            _CONFIG_PERIPHERAL(E, 4, (PE_4_LPUART3_TX | UART_PULL_UPS)); // LPUART3_TX on PE4 (alt. function 3)
                #elif defined LPUART3_ON_B
            _CONFIG_PERIPHERAL(B, 11, (PB_11_LPUART3_TX | UART_PULL_UPS)); // LPUART3_TX on PB11 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(C, 17, (PC_17_LPUART3_TX | UART_PULL_UPS)); // LPUART3_TX on PC17 (alt. function 3)
                #endif
            #endif
            iInterruptID = irq_LPUART3_ID;                               // LPUART3 transmitter shares interrupt vector with receiver
            ucPriority = PRIORITY_LPUART3;
            InterruptFunc = _LPSCI3_Interrupt;
            break;
        case LPUART_RX_PIN:                                              // LPUART3 rx pin configuration
            iInterruptID = irq_LPUART3_ID;                               // LPUART3 receiver shares interrupt vector with transmitter
            ucPriority = PRIORITY_LPUART3;
            InterruptFunc = _LPSCI3_Interrupt;
            if ((LPUART3_CTRL & LPUART_CTRL_LOOPS) != 0) {               // loop-back/single-wire mode doesn't configure/use the LPUARTx_Rx pin
                break;
            }
            #if defined _iMX
                #if defined iMX_RT1011
            IOMUXC_LPUART4_RXD_SELECT_INPUT = IOMUXC_LPUART4_RXD_SELECT_INPUT_GPIO_05_ALT3; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_05, LPUART4_RXD, UART_PULL_UPS);     // select LPUART4 Rx on GPIO1-05    alt. function 3 [iMX LPUARTs count 1..8]
                #elif defined iMX_RT105X || defined iMX_RT106X
                    #if defined UART4_ON_4
            IOMUXC_LPUART4_RX_SELECT_INPUT = IOMUXC_LPUART4_RX_SELECT_INPUT_GPIO_EMC_20_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_20, LPUART4_RX, UART_PULL_UPS); // select LPUART4 Rx on GPIO4-20 - alt function 2 [iMX LPUARTs count 1..8]
                   #else
            IOMUXC_LPUART4_RX_SELECT_INPUT = IOMUXC_LPUART4_RX_SELECT_INPUT_GPIO_B1_01_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_B1_01, LPUART4_RXD, UART_PULL_UPS); // select LPUART4 Rx on GPIO2-17 - alt function 2 [iMX LPUARTs count 1..8]
                   #endif
                #elif defined iMX_RT1015
            IOMUXC_LPUART4_RX_SELECT_INPUT = IOMUXC_LPUART4_TX_SELECT_INPUT_GPIO_EMC_32_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_33, LPUART4_RX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Rx on GPIO3-01 - alt. function 2 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART3_ON_EMC_LOW
            IOMUXC_LPUART4_RX_SELECT_INPUT = IOMUXC_LPUART4_RX_SELECT_INPUT_GPIO_EMC_03_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_03, LPUART4_RX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Rx on GPIO2-03 - alt. function 2 [iMX LPUARTs count 1..8]
                    #elif defined LPUART3_ON_EMC_HIGH
            IOMUXC_LPUART4_RX_SELECT_INPUT = IOMUXC_LPUART4_RX_SELECT_INPUT_GPIO_EMC_33_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_33, LPUART4_RX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Rx on GPIO3-01 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART4_RX_SELECT_INPUT = IOMUXC_LPUART4_RX_SELECT_INPUT_GPIO_AD_B1_11_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_11, LPUART4_RX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 Rx on GPIO1-27 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #elif defined KINETIS_K80
               #if defined LPUART2_ON_E
            _CONFIG_PERIPHERAL(E, 5, (PE_3_LPUART3_RX | UART_PULL_UPS)); // LPUART3_RX on PE3 (alt. function 3)
                #elif defined LPUART3_ON_B
            _CONFIG_PERIPHERAL(B, 10, (PB_10_LPUART3_RX | UART_PULL_UPS)); // LPUART3_RX on PB10 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(C, 16, (PC_16_LPUART3_RX | UART_PULL_UPS)); // LPUART3_RX on PC16 (alt. function 3)
                #endif
            #endif
            break;
        #if defined SUPPORT_HW_FLOW
        case LPUART_CTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_CTS_CONTROL // use GPIO interrupt
            _EXCEPTION("To do");
            #else                                                        // use dedicated CTS line
                #if defined _iMX && defined iMX_RT106X
            _CONFIG_PERIPHERAL(GPIO_EMC_17, LPUART4_CTS_B, UART_PULL_UPS); // select LPUART4 CTS on GPIO4-17 - alt function 2 [iMX LPUARTs count 1..8]
                #else
            _EXCEPTION("To do");
                #endif
            #endif
            break;
        case LPUART_RTS_PIN:
            #if defined _iMX
                #if (defined iMX_RT105X || defined iMX_RT106X) && defined UART4_ON_4
            _CONFIG_PERIPHERAL(GPIO_EMC_18, LPUART4_RTS_B, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART4 RTS on GPIO4-18 [iMX LPUARTs count 1..8]
                #else
            _EXCEPTION("To do...");
                #endif
            #else
            _EXCEPTION("To do...");
            #endif
            break;
        #endif
        }
        break;
    #endif

    #if defined FIFTH_LPUART_CHANNEL
    case FIFTH_LPUART_CHANNEL:
        switch (iPinReference) {
        case LPUART_TX_PIN:                                              // LPUART4 tx pin configuration
            #if defined _iMX
                #if defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART5_TX_SELECT_INPUT = IOMUXC_LPUART5_TX_SELECT_INPUT_GPIO_B1_12_ALT1; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_B1_12, LPUART5_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART5 Tx on GPIO2-28 - alt function 1 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART5_ON_EMC
            IOMUXC_LPUART5_TX_SELECT_INPUT = IOMUXC_LPUART5_TX_SELECT_INPUT_GPIO_EMC_38_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_38, LPUART5_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART5 Tx on GPIO3-06 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART5_TX_SELECT_INPUT = IOMUXC_LPUART5_TX_SELECT_INPUT_GPIO_AD_B0_10_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B0_10, LPUART5_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART5 Tx on GPIO1-10 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #elif defined KINETIS_K80
               #if defined LPUART4_ON_A
            _CONFIG_PERIPHERAL(A, 20, (PA_20_LPUART4_TX | UART_PULL_UPS)); // LPUART4_TX on PA20 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(C, 15, (PC_15_LPUART4_TX | UART_PULL_UPS)); // LPUART4_TX on PC15 (alt. function 3)
                #endif
            #endif
            iInterruptID = irq_LPUART4_ID;                               // LPUART4 transmitter shares interrupt vector with receiver
            ucPriority = PRIORITY_LPUART4;
            InterruptFunc = _LPSCI4_Interrupt;
            break;
        case LPUART_RX_PIN:                                              // LPUART4 rx pin configuration
            iInterruptID = irq_LPUART4_ID;                               // LPUART4 receiver shares interrupt vector with transmitter
            ucPriority = PRIORITY_LPUART4;
            InterruptFunc = _LPSCI4_Interrupt;
            if ((LPUART4_CTRL & LPUART_CTRL_LOOPS) != 0) {               // loop-back/single-wire mode doesn't configure/use the LPUARTx_Rx pin
                break;
            }
            #if defined _iMX
                #if defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART5_RX_SELECT_INPUT = IOMUXC_LPUART5_RX_SELECT_INPUT_GPIO_B1_13_ALT1; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_B1_13, LPUART5_RXD, UART_PULL_UPS); // select LPUART5 Rx on GPIO2-29 - alt function 1 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART5_ON_EMC
            IOMUXC_LPUART5_RX_SELECT_INPUT = IOMUXC_LPUART5_RX_SELECT_INPUT_GPIO_EMC_39_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_39, LPUART5_RX, (UART_PULL_UPS));// select LPUART5 Rx on GPIO3-07 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART5_RX_SELECT_INPUT = IOMUXC_LPUART5_RX_SELECT_INPUT_GPIO_AD_B0_11_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B0_11, LPUART5_RX, (UART_PULL_UPS)); // select LPUART5 Rx on GPIO1-11 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #elif defined KINETIS_K80
               #if defined LPUART4_ON_A
            _CONFIG_PERIPHERAL(A, 21, (PA_21_LPUART4_RX | UART_PULL_UPS)); // LPUART4_RX on PA21 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(C, 14, (PC_14_LPUART4_RX | UART_PULL_UPS)); // LPUART4_RX on PC14 (alt. function 3)
                #endif
            #endif
            break;
        #if defined SUPPORT_HW_FLOW
        case LPUART_CTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_CTS_CONTROL // use GPIO interrupt
            _EXCEPTION("To do");
            #else                                                        // use dedicated CTS line
            _EXCEPTION("To do");
            #endif
            break;
        case LPUART_RTS_PIN:
            _EXCEPTION("To do...");
            break;
        #endif
        }
        break;
    #endif

