sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
    #if defined SIXTH_LPUART_CHANNEL
    case SIXTH_LPUART_CHANNEL:
        switch (iPinReference) {
        case LPUART_TX_PIN:                                              // LPUART5 tx pin configuration
            #if defined _iMX
                #if defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART6_TX_SELECT_INPUT = IOMUXC_LPUART6_TX_SELECT_INPUT_GPIO_EMC_25_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_25, LPUART6_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART6 Tx on GPIO4-25 - alt function 2 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART6_ON_EMC
            IOMUXC_LPUART6_TX_SELECT_INPUT = IOMUXC_LPUART6_TX_SELECT_INPUT_GPIO_EMC_12_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_12, LPUART6_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART6 Tx on GPIO2-12 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART6_TX_SELECT_INPUT = IOMUXC_LPUART6_TX_SELECT_INPUT_GPIO_SD_B1_00_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_SD_B1_00, LPUART6_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART6 Tx on GPIO3-20 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #endif
            iInterruptID = irq_LPUART5_ID;                               // LPUART5 transmitter shares interrupt vector with receiver
            ucPriority = PRIORITY_LPUART5;
            InterruptFunc = _LPSCI5_Interrupt;
            break;
        case LPUART_RX_PIN:                                              // LPUART5 rx pin configuration
            iInterruptID = irq_LPUART5_ID;                               // LPUART5 receiver shares interrupt vector with transmitter
            ucPriority = PRIORITY_LPUART5;
            InterruptFunc = _LPSCI5_Interrupt;
            if ((LPUART5_CTRL & LPUART_CTRL_LOOPS) != 0) {               // loop-back/single-wire mode doesn't configure/use the LPUARTx_Rx pin
                break;
            }
            #if defined _iMX
                #if defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART6_RX_SELECT_INPUT = IOMUXC_LPUART6_RX_SELECT_INPUT_GPIO_EMC_26_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_26, LPUART6_RXD, UART_PULL_UPS); // select LPUART6 Rx on GPIO4-26 - alt function 2 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART6_ON_EMC
            IOMUXC_LPUART6_RX_SELECT_INPUT = IOMUXC_LPUART6_RX_SELECT_INPUT_GPIO_EMC_13_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_13, LPUART6_RX, (UART_PULL_UPS)); // select LPUART6 Rx on GPIO2-13 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART6_RX_SELECT_INPUT = IOMUXC_LPUART6_RX_SELECT_INPUT_GPIO_SD_B1_01_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_SD_B1_01, LPUART6_RX, (UART_PULL_UPS)); // select LPUART6 Rx on GPIO3-21 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #endif
            break;
        #if defined SUPPORT_HW_FLOW
        case LPUART_CTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_CTS_CONTROL // use GPIO interrupt
            _EXCEPTION("To do");
            #else                                                        // use dedicated CTS line
            _EXCEPTION("To do");
            #endif
            break;
        case LPUART_RTS_PIN:
            #if defined _iMX
                #if (defined iMX_RT105X || defined iMX_RT106X)
            _CONFIG_PERIPHERAL(GPIO_EMC_29, LPUART6_RTS_B, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART6 RTS on GPIO4-29 [iMX LPUARTs count 1..8]
                #else
            _EXCEPTION("To do...");
                #endif
            #else
            _EXCEPTION("To do...");
            #endif
            break;
        #endif
        }
        break;
    #endif

    #if defined SEVENTH_LPUART_CHANNEL
    case SEVENTH_LPUART_CHANNEL:
        switch (iPinReference) {
        case LPUART_TX_PIN:                                              // LPUART6 tx pin configuration
            #if defined _iMX
                #if defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART7_TX_SELECT_INPUT = IOMUXC_LPUART7_TX_SELECT_INPUT_GPIO_EMC_31_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_31, LPUART7_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART7 Tx on GPIO4-31 - alt function 2 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART7_ON_EMC
            IOMUXC_LPUART7_TX_SELECT_INPUT = IOMUXC_LPUART7_TX_SELECT_INPUT_GPIO_EMC_34_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_34, LPUART7_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART7 Tx on GPIO3-02 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART7_TX_SELECT_INPUT = IOMUXC_LPUART7_TX_SELECT_INPUT_GPIO_SD_B0_04_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_SD_B0_04, LPUART7_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART7 Tx on GPIO3-17 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #endif
            iInterruptID = irq_LPUART6_ID;                               // LPUART6 transmitter shares interrupt vector with receiver
            ucPriority = PRIORITY_LPUART6;
            InterruptFunc = _LPSCI6_Interrupt;
            break;
        case LPUART_RX_PIN:                                              // LPUART6 rx pin configuration
            iInterruptID = irq_LPUART6_ID;                               // LPUART6 receiver shares interrupt vector with transmitter
            ucPriority = PRIORITY_LPUART6;
            InterruptFunc = _LPSCI6_Interrupt;
            if ((LPUART6_CTRL & LPUART_CTRL_LOOPS) != 0) {               // loop-back/single-wire mode doesn't configure/use the LPUARTx_Rx pin
                break;
            }
            #if defined _iMX
                #if defined iMX_RT105X || defined iMX_RT106X
            IOMUXC_LPUART7_RX_SELECT_INPUT = IOMUXC_LPUART7_RX_SELECT_INPUT_GPIO_EMC_32_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_32, LPUART7_RXD, UART_PULL_UPS); // select LPUART7 Rx on GPIO3-18 - alt function 2 [iMX LPUARTs count 1..8]
                #else
                    #if defined LPUART7_ON_EMC
            IOMUXC_LPUART7_RX_SELECT_INPUT = IOMUXC_LPUART7_RX_SELECT_INPUT_GPIO_EMC_35_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_35, LPUART7_RX, (UART_PULL_UPS)); // select LPUART7 Rx on GPIO3-03 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART7_RX_SELECT_INPUT = IOMUXC_LPUART7_RX_SELECT_INPUT_GPIO_SD_B0_05_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_SD_B0_05, LPUART7_RX, (UART_PULL_UPS)); // select LPUART7 Rx on GPIO3-18 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #endif
            break;
        #if defined SUPPORT_HW_FLOW
        case LPUART_CTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_CTS_CONTROL // use GPIO interrupt
            _EXCEPTION("To do");
            #else                                                        // use dedicated CTS line
            _EXCEPTION("To do");
            #endif
            break;
        case LPUART_RTS_PIN:
            _EXCEPTION("To do...");
            break;
        #endif
        }
        break;
    #endif

    #if defined EIGHTH_LPUART_CHANNEL
    case EIGHTH_LPUART_CHANNEL:
        switch (iPinReference) {
        case LPUART_TX_PIN:                                              // LPUART7 tx pin configuration
            #if defined _iMX
                #if defined iMX_RT105X || defined iMX_RT106X
                    #if defined LPUART8_ON_AD
            IOMUXC_LPUART8_TX_SELECT_INPUT = IOMUXC_LPUART8_TX_SELECT_INPUT_GPIO_AD_B1_10_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_10, LPUART8_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART8 Tx on GPIO1-26 - alt function 2 [iMX LPUARTs count 1..8]
                    #elif defined LPUART8_ON_SD
            IOMUXC_LPUART8_TX_SELECT_INPUT = IOMUXC_LPUART8_TX_SELECT_INPUT_GPIO_SD_B0_04_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_SD_B0_04, LPUART8_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART8 Tx on GPIO3-16 - alt function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART8_TX_SELECT_INPUT = IOMUXC_LPUART8_TX_SELECT_INPUT_GPIO_EMC_38_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_38, LPUART8_TXD, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART8 Tx on GPIO3-24 - alt function 2 [iMX LPUARTs count 1..8]
                    #endif
                #else
                    #if defined LPUART8_ON_EMC
            IOMUXC_LPUART8_TX_SELECT_INPUT = IOMUXC_LPUART8_TX_SELECT_INPUT_GPIO_EMC_26_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_26, LPUART8_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART8 Tx on GPIO2-26 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART8_TX_SELECT_INPUT = IOMUXC_LPUART8_TX_SELECT_INPUT_GPIO_SD_B1_02_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_SD_B1_02, LPUART8_TX, (UART_PULL_UPS | PORT_DSE_MID)); // select LPUART8 Tx on GPIO3-22 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #endif
            iInterruptID = irq_LPUART7_ID;                               // LPUART7 transmitter shares interrupt vector with receiver
            ucPriority = PRIORITY_LPUART7;
            InterruptFunc = _LPSCI7_Interrupt;
            break;
        case LPUART_RX_PIN:                                              // LPUART7 rx pin configuration
            iInterruptID = irq_LPUART7_ID;                               // LPUART7 receiver shares interrupt vector with transmitter
            ucPriority = PRIORITY_LPUART7;
            InterruptFunc = _LPSCI7_Interrupt;
            if ((LPUART7_CTRL & LPUART_CTRL_LOOPS) != 0) {               // loop-back/single-wire mode doesn't configure/use the LPUARTx_Rx pin
                break;
            }
            #if defined _iMX
                #if defined iMX_RT105X || defined iMX_RT106X
                    #if defined LPUART8_ON_AD
            IOMUXC_LPUART8_RX_SELECT_INPUT = IOMUXC_LPUART8_RX_SELECT_INPUT_GPIO_AD_B1_11_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_AD_B1_11, LPUART8_RXD, UART_PULL_UPS); // select LPUART8 Rx on GPIO1-27 - alt function 2 [iMX LPUARTs count 1..8]
                    #elif defined LPUART8_ON_SD
            IOMUXC_LPUART8_RX_SELECT_INPUT = IOMUXC_LPUART8_RX_SELECT_INPUT_GPIO_SD_B0_05_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_SD_B0_05, LPUART8_RXD, UART_PULL_UPS); // select LPUART8 Rx on GPIO3-17 - alt function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART8_RX_SELECT_INPUT = IOMUXC_LPUART8_RX_SELECT_INPUT_GPIO_EMC_39_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_39, LPUART8_RXD, UART_PULL_UPS); // select LPUART8 Rx on GPIO3-24 - alt function 2 [iMX LPUARTs count 1..8]
                    #endif
                #else
                    #if defined LPUART8_ON_EMC
            IOMUXC_LPUART8_RX_SELECT_INPUT = IOMUXC_LPUART8_RX_SELECT_INPUT_GPIO_EMC_27_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_EMC_27, LPUART8_RX, (UART_PULL_UPS));// select LPUART8 Rx on GPIO2-27 - alt. function 2 [iMX LPUARTs count 1..8]
                    #else
            IOMUXC_LPUART8_RX_SELECT_INPUT = IOMUXC_LPUART8_RX_SELECT_INPUT_GPIO_SD_B1_03_ALT2; // special case to select the pad involved in daisy chain
            _CONFIG_PERIPHERAL(GPIO_SD_B1_03, LPUART8_RX, (UART_PULL_UPS)); // select LPUART8 Rx on GPIO3-23 - alt. function 2 [iMX LPUARTs count 1..8]
                    #endif
                #endif
            #endif
            break;
        #if defined SUPPORT_HW_FLOW
        case LPUART_CTS_PIN:
            #if defined LPUART_WITHOUT_MODEM_CONTROL || defined LPUART0_MANUAL_CTS_CONTROL // use GPIO interrupt
            _EXCEPTION("To do");
            #else                                                        // use dedicated CTS line
            _EXCEPTION("To do");
            #endif
            break;
        case LPUART_RTS_PIN:
            _EXCEPTION("To do...");
            break;
        #endif
        }
        break;
    #endif

    #if defined FIRST_UART_CHANNEL
    case FIRST_UART_CHANNEL:
        switch (iPinReference) {
        case UART_TX_PIN:                                                // UART0 tx pin configuration
        #if defined KINETIS_KL02 || defined KINETIS_KL03 || defined KINETIS_KL04 || defined KINETIS_KL05
            #if defined KINETIS_KL03 && defined UART0_OPTION_3
            _CONFIG_PERIPHERAL(A, 3, (PA_3_UART0_TX | UART_PULL_UPS));   // UART0_TX on PA3 (alt. function 4)
            #elif defined UART0_OPTION_2
            _CONFIG_PERIPHERAL(B, 3, (PB_3_UART0_TX | UART_PULL_UPS));   // UART0_TX on PB3 (alt. function 3)
            #elif defined UART0_OPTION_1
            _CONFIG_PERIPHERAL(B, 2, (PB_2_UART0_TX | UART_PULL_UPS));   // UART0_TX on PB2 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(B, 1, (PB_1_UART0_TX | UART_PULL_UPS));   // UART0_TX on PB1 (alt. function 2)
            #endif
        #elif defined KINETIS_K02
            #if defined UART0_A_LOW
            _CONFIG_PERIPHERAL(A, 2, (PA_2_UART0_TX | UART_PULL_UPS));   // UART0_TX on PA2 (alt. function 2)
            #elif defined UART0_ON_D
            _CONFIG_PERIPHERAL(D, 7, (PD_7_UART0_TX | UART_PULL_UPS));   // UART0_TX on PD7 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(B, 17, (PB_17_UART0_TX | UART_PULL_UPS)); // UART0_TX on PB17 (alt. function 3)
            #endif
        #elif defined KINETIS_KE
            #if defined UART0_ON_A
            SIM_PINSEL0 |= (SIM_PINSEL_UART0PS);
            _CONFIG_PERIPHERAL(A, 3, (PA_3_UART0_TX | UART_PULL_UPS));   // UART0_TX on PA3 (alt. function 2)
            #else
            _CONFIG_PERIPHERAL(B, 1, (PB_1_UART0_TX | UART_PULL_UPS));   // UART0_TX on PB1 (alt. function 2)
            #endif
        #else
            #if defined UART0_A_LOW
            _CONFIG_PERIPHERAL(A, 2, (PA_2_UART0_TX | UART_PULL_UPS));   // UART0_TX on PA2 (alt. function 2)
            #elif defined UART0_ON_B_LOW && (defined KINETIS_KV31 || defined KINETIS_KV50)
            _CONFIG_PERIPHERAL(B, 1, (PB_1_UART0_TX | UART_PULL_UPS));   // UART0_TX on PB1 (alt. function 7)
            #elif defined UART0_ON_C && defined KINETIS_KV50
            _CONFIG_PERIPHERAL(C, 7, (PC_7_UART0_TX | UART_PULL_UPS));   // UART0_TX on PC7 (alt. function 5)
            #elif defined UART0_ON_B
            _CONFIG_PERIPHERAL(B, 17, (PB_17_UART0_TX | UART_PULL_UPS)); // UART0_TX on PB17 (alt. function 3)
            #elif defined UART0_ON_D
            _CONFIG_PERIPHERAL(D, 7, (PD_7_UART0_TX | UART_PULL_UPS));   // UART0_TX on PD7 (alt. function 3)
            #elif defined KINETIS_KL && defined UART0_ON_E
            _CONFIG_PERIPHERAL(E, 20, (PE_20_UART0_TX | UART_PULL_UPS)); // UART0_TX on PE20 (alt. function 4)
            #else
            _CONFIG_PERIPHERAL(A, 14, (PA_14_UART0_TX | UART_PULL_UPS)); // UART0_TX on PA14 (alt. function 3)
            #endif
        #endif
        #if defined irq_UART0_1_ID
            iInterruptID = irq_LPUART0_TX_ID;                            // UART0/1 transmitter/receiver shared interrupt vector ID
        #else
            iInterruptID = irq_UART0_ID;                                 // UART0 transmitter/receiver interrupt vector ID
        #endif
            ucPriority = PRIORITY_UART0;
            InterruptFunc = _SCI0_Interrupt;
            break;

