sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
        case UART_RX_PIN:                                                // UART0 rx pin configuration
        #if defined irq_UART0_1_ID
            iInterruptID = irq_UART0_1_ID;                               // UART0 / 1 transmitter / receiver shared interrupt vector ID
        #else
            iInterruptID = irq_UART0_ID;                                 // UART0 transmitter/receiver interrupt vector ID
        #endif
            ucPriority = PRIORITY_UART0;
            InterruptFunc = _SCI0_Interrupt;
        #if defined UART_ERROR_INTERRUPT_VECTOR                          // {1}
            InterruptErrorFunc = _SCI0_Error_Interrupt;
            ucErrorPriority = PRIORITY_ERROR_UART0;
        #endif
            if ((UART0_C1 & UART_C1_LOOPS) != 0) {                       // loop-back/single-wire mode doesn't configure/use the UARTx_Rx pin
                break;
            }
        #if defined KINETIS_KL02 || defined KINETIS_KL03 || defined KINETIS_KL04 || defined KINETIS_KL05
            #if defined KINETIS_KL03 && defined UART0_OPTION_3
            _CONFIG_PERIPHERAL(A, 4, (PA_4_UART0_RX | UART_PULL_UPS));   // UART0_RX on PA4 (alt. function 4)
            #elif defined UART0_OPTION_2
            _CONFIG_PERIPHERAL(B, 4, (PB_4_UART0_RX | UART_PULL_UPS));   // UART0_RX on PB4 (alt. function 3)
            #elif defined UART0_OPTION_1
            _CONFIG_PERIPHERAL(B, 1, (PB_1_UART0_RX | UART_PULL_UPS));   // UART0_RX on PB1 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(B, 2, (PB_2_UART0_RX | UART_PULL_UPS));   // UART0_RX on PB2 (alt. function 2)
            #endif
        #elif defined KINETIS_K02
            #if defined UART0_A_LOW
            _CONFIG_PERIPHERAL(A, 1, (PA_1_UART0_RX | UART_PULL_UPS));   // UART0_RX on PA1 (alt. function 2)
            #elif defined UART0_ON_D
            _CONFIG_PERIPHERAL(D, 6, (PD_6_UART0_RX | UART_PULL_UPS));   // UART0_RX on PD6 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(B, 16, (PB_16_UART0_RX | UART_PULL_UPS)); // UART0_RX on PB16 (alt. function 3)
            #endif
        #elif defined KINETIS_KE
            #if defined UART0_ON_A
            SIM_PINSEL0 |= (SIM_PINSEL_UART0PS);
            _CONFIG_PERIPHERAL(A, 2, (PA_2_UART0_RX | UART_PULL_UPS));   // UART0_RX on PA2 (alt. function 2)
            #else
            _CONFIG_PERIPHERAL(B, 0, (PB_0_UART0_RX | UART_PULL_UPS));   // UART0_RX on PB0 (alt. function 2)
            #endif
        #else
            #if defined UART0_A_LOW
            _CONFIG_PERIPHERAL(A, 1, (PA_1_UART0_RX | UART_PULL_UPS));   // UART0_RX on PA1 (alt. function 2)
            #elif defined UART0_ON_B_LOW && (defined KINETIS_KV31 || defined KINETIS_KV50)
            _CONFIG_PERIPHERAL(B, 0, (PB_0_UART0_RX | UART_PULL_UPS));   // UART0_RX on PB0 (alt. function 7)
            #elif defined UART0_ON_C && defined KINETIS_KV50
            _CONFIG_PERIPHERAL(C, 6, (PC_6_UART0_RX | UART_PULL_UPS));   // UART0_RX on PC6 (alt. function 5)
            #elif defined UART0_ON_B
            _CONFIG_PERIPHERAL(B, 16, (PB_16_UART0_RX | UART_PULL_UPS)); // UART0_RX on PB16 (alt. function 3)
            #elif defined UART0_ON_D
            _CONFIG_PERIPHERAL(D, 6, (PD_6_UART0_RX | UART_PULL_UPS));   // UART0_RX on PD6 (alt. function 3)
            #elif defined KINETIS_KL && defined UART0_ON_E
            _CONFIG_PERIPHERAL(E, 21, (PE_21_UART0_RX | UART_PULL_UPS)); // UART0_RX on PE21 (alt. function 4)
            #else
            _CONFIG_PERIPHERAL(A, 15, (PA_15_UART0_RX | UART_PULL_UPS)); // UART0_RX on PA15 (alt. function 3)
            #endif
        #endif
            break;
        #if defined SUPPORT_HW_FLOW
            #if defined UART0_MANUAL_RTS_CONTROL
        case UART_RTS_RS485_MANUAL_MODE:
            return 1;                                                    // this UART's RTS line is manually controlled in RS485 mode
            #endif
            #if defined UART_WITHOUT_MODEM_CONTROL || defined UART0_MANUAL_RTS_CONTROL
        case UART_RTS_PIN_ASSERT:
            if (ucRTS_neg[0] == 0) {
                _SET_RTS_0_HIGH();
            }
            else {
                _SET_RTS_0_LOW();
            }
            break;
        case UART_RTS_PIN_NEGATE:
            if (ucRTS_neg[0] == 0) {
                _SET_RTS_0_LOW();
            }
            else {
                _SET_RTS_0_HIGH();
            }
            break;
            #endif

        case UART_RTS_PIN_INVERTED:
        case UART_RTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL || defined UART0_MANUAL_RTS_CONTROL
            if (iPinReference != UART_RTS_PIN_INVERTED) {
                _CONFIGURE_RTS_0_LOW();                                  // configure RTS output and set to '0'
                ucRTS_neg[0] = 0;                                        // not inverted RTS mode
            }
            else {
                _CONFIGURE_RTS_0_HIGH();                                 // configure RTS output and set to '1'
                ucRTS_neg[0] = 1;                                        // inverted RTS mode
            }
            #elif defined KINETIS_K02
                #if defined UART0_A_LOW
            _CONFIG_PERIPHERAL(A, 3, (PA_3_UART0_RTS | UART_PULL_UPS));  // UART0_RX on PA3 (alt. function 2)
                #elif defined UART0_ON_D
            _CONFIG_PERIPHERAL(D, 4, (PD_4_UART0_RTS | UART_PULL_UPS));  // UART0_RX on PD4 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(B, 2, (PB_2_UART0_RTS | UART_PULL_UPS));  // UART0_RX on PB2 (alt. function 3)
                #endif
            #elif defined UART0_A_LOW
            _CONFIG_PERIPHERAL(A, 3, (PA_3_UART0_RTS | UART_PULL_UPS));  // UART0_RTS on PA3 (alt. function 2)
            #elif defined UART0_ON_B
            _CONFIG_PERIPHERAL(B, 2, (PB_2_UART0_RTS | UART_PULL_UPS));  // UART0_RTS on PB2 (alt. function 3)
            #elif defined UART0_ON_D
            _CONFIG_PERIPHERAL(D, 4, (PD_4_UART0_RTS | UART_PULL_UPS));  // UART0_RTS on PD4 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(A, 17, (PA_17_UART0_RTS | UART_PULL_UPS));// UART0_RTS on A17 (alt. function 3)
            #endif
            break;

        case UART_CTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL
            #elif defined KINETIS_K02
                #if defined UART0_A_LOW
            _CONFIG_PERIPHERAL(A, 0, (PA_0_UART0_CTS | UART_PULL_UPS));  // UART0_CTS on PA0 (alt. function 2)
                #elif defined UART0_ON_D
            _CONFIG_PERIPHERAL(D, 5, (PD_5_UART0_CTS | UART_PULL_UPS));  // UART0_CTS on PD5 (alt. function 3)
                #else
            _CONFIG_PERIPHERAL(A, 0, (PA_0_UART0_CTS | UART_PULL_UPS));  // UART0_CTS on PA0 (alt. function 2)
                #endif
            #elif defined UART0_A_LOW
            _CONFIG_PERIPHERAL(A, 0, (PA_0_UART0_CTS | UART_PULL_UPS));  // UART0_CTS on PA0 (alt. function 2)
            #elif defined UART0_ON_B
            _CONFIG_PERIPHERAL(B, 3, (PB_3_UART0_CTS | UART_PULL_UPS));  // UART0_CTS on PB3 (alt. function 3)
            #elif defined UART0_ON_D
            _CONFIG_PERIPHERAL(D, 5, (PD_5_UART0_CTS | UART_PULL_UPS));  // UART0_CTS on PD5 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(A, 16, (PA_16_UART0_CTS | UART_PULL_UPS));// UART0_CTS on PA16 (alt. function 3)
            #endif
            break;
        #endif
        }
        break;
    #endif

    #if defined SECOND_UART_CHANNEL
    case SECOND_UART_CHANNEL:
        switch (iPinReference) {
        case UART_TX_PIN:                                                // UART1 tx pin configuration
        #if defined KINETIS_KM
            _CONFIG_PERIPHERAL(I, 1, (PI_1_SCI1_TX | UART_PULL_UPS));    // UART1_TX on PI1 (alt. function 2)
        #elif defined KINETIS_KE
            _CONFIG_PERIPHERAL(C, 7, (PC_7_UART1_TX | UART_PULL_UPS));   // UART1_TX on PC7 (alt. function 2)
        #elif defined KINETIS_KV10 || defined KINETIS_KV11
            _CONFIG_PERIPHERAL(D, 1, (PD_1_UART1_TX | UART_PULL_UPS));   // UART1_TX on PD1 (alt. function 5)
        #elif defined KINETIS_K02
            #if defined UART1_ON_E_HIGH
            _CONFIG_PERIPHERAL(E, 16, (PE_16_UART1_TX | UART_PULL_UPS)); // UART1_TX on PE16 (alt. function 3)
            #elif defined UART1_ON_E_LOW
            _CONFIG_PERIPHERAL(E, 0, (PE_0_UART1_TX | UART_PULL_UPS));   // UART1_TX on PE0 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(C, 4, (PC_4_UART1_TX | UART_PULL_UPS));   // UART1_TX on PC4 (alt. function 3)
            #endif
        #else
            #if defined UART1_ON_C && !defined UART1_ON_A_TX
            _CONFIG_PERIPHERAL(C, 4, (PC_4_UART1_TX | UART_PULL_UPS));   // UART1_TX on PC4 (alt. function 3)
            #elif defined KINETIS_KL && (defined UART1_ON_A || defined UART1_ON_A_TX)
            _CONFIG_PERIPHERAL(A, 19, (PA_19_UART1_TX | UART_PULL_UPS)); // UART1_TX on PA19 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(E, 0, (PE_0_UART1_TX | UART_PULL_UPS));   // UART1_TX on PE0 (alt. function 3)
            #endif
        #endif
        #if defined irq_UART0_1_ID
            iInterruptID = irq_UART0_1_ID;                               // UART0/1 transmitter/receiver shared interrupt vector ID
        #else
            iInterruptID = irq_UART1_ID;                                 // UART1 transmitter/receiver interrupt vector ID
        #endif
            ucPriority = PRIORITY_UART1;
            InterruptFunc = _SCI1_Interrupt;
            break;

