sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
        case UART_RX_PIN:                                                // UART1 rx pin configuration
        #if defined irq_UART0_1_ID
            iInterruptID = irq_UART0_1_ID;                               // UART0/1 transmitter/receiver shared interrupt vector ID
        #else
            iInterruptID = irq_UART1_ID;                                 // UART1 transmitter/receiver interrupt vector ID
        #endif
            ucPriority = PRIORITY_UART1;
            InterruptFunc = _SCI1_Interrupt;
        #if defined UART_ERROR_INTERRUPT_VECTOR                          // {1}
            InterruptErrorFunc = _SCI1_Error_Interrupt;
            ucErrorPriority = PRIORITY_ERROR_UART1;
        #endif
            if ((UART1_C1 & UART_C1_LOOPS) != 0) {                       // loop-back/single-wire mode doesn't configure/use the UARTx_Rx pin
                break;
            }
        #if defined KINETIS_KM
            _CONFIG_PERIPHERAL(I, 0, (PI_0_SCI1_TX | UART_PULL_UPS));    // UART1_RX on PI0 (alt. function 2)
        #elif defined KINETIS_KE
            _CONFIG_PERIPHERAL(C, 6, (PC_6_UART1_RX | UART_PULL_UPS));   // UART1_RX on PC6 (alt. function 2)
        #elif defined KINETIS_KV10 || defined KINETIS_KV11
            _CONFIG_PERIPHERAL(D, 0, (PD_0_UART1_RX | UART_PULL_UPS));   // UART1_RX on PD0 (alt. function 5)
        #elif defined KINETIS_K02
            #if defined UART1_ON_E_HIGH
            _CONFIG_PERIPHERAL(E, 17, (PE_17_UART1_RX | UART_PULL_UPS)); // UART1_RX on PE17 (alt. function 3)
            #elif defined UART1_ON_E_LOW
            _CONFIG_PERIPHERAL(E, 1, (PE_1_UART1_RX | UART_PULL_UPS));   // UART1_RX on PE1 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(C, 3, (PC_3_UART1_RX | UART_PULL_UPS));   // UART1_RX on PC3 (alt. function 3)
            #endif
        #else
            #if defined UART1_ON_C
            _CONFIG_PERIPHERAL(C, 3, (PC_3_UART1_RX | UART_PULL_UPS));   // UART1_RX on PC3 (alt. function 3)
            #elif defined KINETIS_KL && defined UART1_ON_A
            _CONFIG_PERIPHERAL(A, 18, (PA_18_UART1_RX | UART_PULL_UPS)); // UART1_RX on PA18 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(E, 1, (PE_1_UART1_RX | UART_PULL_UPS));   // UART1_RX on PE1 (alt. function 3)
            #endif
        #endif
            break;

        #if defined SUPPORT_HW_FLOW
            #if defined UART1_MANUAL_RTS_CONTROL
        case UART_RTS_RS485_MANUAL_MODE:
            return 1;                                                    // this UART's RTS line is manually controlled in RS485 mode
            #endif
            #if defined UART_WITHOUT_MODEM_CONTROL || defined UART1_MANUAL_RTS_CONTROL
        case UART_RTS_PIN_ASSERT:
            if (ucRTS_neg[1] == 0) {
                _SET_RTS_1_HIGH();
            }
            else {
                _SET_RTS_1_LOW();
            }
            break;
        case UART_RTS_PIN_NEGATE:
            if (ucRTS_neg[1] == 0) {
                _SET_RTS_1_LOW();
            }
            else {
                _SET_RTS_1_HIGH();
            }
            break;
            #endif

        case UART_RTS_PIN_INVERTED:
        case UART_RTS_PIN:                                               // configure RTS1 pin
            #if defined UART_WITHOUT_MODEM_CONTROL || defined UART1_MANUAL_RTS_CONTROL
            if (iPinReference != UART_RTS_PIN_INVERTED) {
                _CONFIGURE_RTS_1_LOW();                                  // configure RTS output and set to '0'
                ucRTS_neg[1] = 0;                                        // not inverted RTS mode
            }
            else {
                _CONFIGURE_RTS_1_HIGH();                                 // configure RTS output and set to '1'
                ucRTS_neg[1] = 1;                                        // inverted RTS mode
            }
            #elif defined UART1_ON_C
            _CONFIG_PERIPHERAL(C, 1, (PC_1_UART1_RTS | UART_PULL_UPS));  // UART1_RTS on PC1 (alt. function 3) {16}
            #else
            _CONFIG_PERIPHERAL(E, 3, (PE_3_UART1_RTS | UART_PULL_UPS));  // UART1_RTS on PE3 (alt. function 3)
            #endif
            break;

        case UART_CTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL
            #elif defined UART1_ON_C
            _CONFIG_PERIPHERAL(C, 2, (PC_2_UART1_CTS | UART_PULL_UPS));  // UART1_CTS on PC2 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(E, 2, (PE_2_UART1_CTS | UART_PULL_UPS));  // UART1_CTS on PE2 (alt. function 3)
            #endif
            break;
        #endif
        }
        break;
    #endif

    #if defined THIRD_UART_CHANNEL
    case THIRD_UART_CHANNEL:
        switch (iPinReference) {
        case UART_TX_PIN:                                                // UART2 tx pin configuration
        #if defined KINETIS_KE
            #if defined UART2_ON_I
            SIM_PINSEL1 |= (SIM_PINSEL1_UART2PS);                        // UART2_TX on PI1
            _CONFIG_PERIPHERAL(I, 1, (PI_1_UART2_TX | UART_PULL_UPS));
            #else
            _CONFIG_PERIPHERAL(D, 7, (PD_7_UART2_TX | UART_PULL_UPS));   // UART2_TX on PD7 (alt. function 2)
            #endif
        #else
            #if (defined KINETIS_K61 || defined KINETIS_K70 || defined KINETIS_K21 || defined KINETIS_KL || defined KINETIS_KV31 || defined KINETIS_KW2X || defined KINETIS_K26 || defined KINETIS_K65) && defined UART2_ON_E // {25}
            _CONFIG_PERIPHERAL(E, 16, (PE_16_UART2_TX | UART_PULL_UPS)); // UART2_TX on PE16 (alt. function 3)
            #elif (defined KINETIS_K61 || defined KINETIS_K70) && defined UART2_ON_F // {25}
            _CONFIG_PERIPHERAL(F, 14, (PF_14_UART2_TX | UART_PULL_UPS)); // UART2_TX on PF14 (alt. function 4)
            #elif defined KINETIS_KL && defined UART2_ON_E_HIGH
            _CONFIG_PERIPHERAL(E, 22, (PE_22_UART2_TX | UART_PULL_UPS)); // UART2_TX on PE22 (alt. function 4)
            #elif defined KINETIS_KL && defined UART2_ON_D_HIGH
            _CONFIG_PERIPHERAL(D, 5, (PE_5_UART2_TX | UART_PULL_UPS));   // UART2_TX on PD5 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(D, 3, (PD_3_UART2_TX | UART_PULL_UPS));   // UART2_TX on PD3 (alt. function 3)
            #endif
        #endif
        #if defined irq_UART2_3_ID
            iInterruptID = irq_UART2_3_ID;                               // UART2/3 transmitter/receiver shared interrupt vector ID
        #else
            iInterruptID = irq_UART2_ID;                                 // UART2 transmitter/receiver interrupt vector ID
        #endif
            ucPriority = PRIORITY_UART2;
            InterruptFunc = _SCI2_Interrupt;
            break;

