sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
        case UART_RX_PIN:                                                // UART2 rx pin configuration
        #if defined irq_UART2_3_ID
            iInterruptID = irq_UART2_3_ID;                               // UART2/3 transmitter/receiver shared interrupt vector ID
        #else
            iInterruptID = irq_UART2_ID;                                 // UART2 transmitter/receiver interrupt vector ID
        #endif
            ucPriority = PRIORITY_UART2;
            InterruptFunc = _SCI2_Interrupt;
        #if defined UART_ERROR_INTERRUPT_VECTOR                          // {1}
            InterruptErrorFunc = _SCI2_Error_Interrupt;
            ucErrorPriority = PRIORITY_ERROR_UART2;
        #endif
            if ((UART2_C1 & UART_C1_LOOPS) != 0) {                       // loop-back/single-wire mode doesn't configure/use the UARTx_Rx pin
                break;
            }
        #if defined KINETIS_KE
            #if defined UART2_ON_I
            SIM_PINSEL1 |= (SIM_PINSEL1_UART2PS);                        // UART2_RX on PI0
            _CONFIG_PERIPHERAL(I, 0, (PI_0_UART2_RX | UART_PULL_UPS));
            #else
            _CONFIG_PERIPHERAL(D, 6, (PD_6_UART2_RX | UART_PULL_UPS));   // UART2_RX on PD6
            #endif
        #else
            #if (defined KINETIS_K61 || defined KINETIS_K70 || defined KINETIS_K21 || defined KINETIS_KL || defined KINETIS_KV31 || defined KINETIS_KW2X || defined KINETIS_K26 || defined KINETIS_K65) && defined UART2_ON_E // {25}
            _CONFIG_PERIPHERAL(E, 17, (PE_17_UART2_RX | UART_PULL_UPS)); // UART2_RX on PE17 (alt. function 3)
            #elif (defined KINETIS_K61 || defined KINETIS_K70) && defined UART2_ON_F // {25}
            _CONFIG_PERIPHERAL(F, 13, (PF_13_UART2_RX | UART_PULL_UPS)); // UART2_RX on PF13 (alt. function 4)
            #elif defined KINETIS_KL && defined UART2_ON_E_HIGH
            _CONFIG_PERIPHERAL(E, 23, (PE_23_UART2_RX | UART_PULL_UPS)); // UART2_RX on PE23 (alt. function 4)
            #elif defined KINETIS_KL && defined UART2_ON_D_HIGH
            _CONFIG_PERIPHERAL(D, 4, (PE_4_UART2_RX | UART_PULL_UPS));   // UART2_RX on PD4 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(D, 2, (PD_2_UART2_RX | UART_PULL_UPS));   // UART2_RX on PD2 (alt. function 3)
            #endif
        #endif
            break;

        #if defined SUPPORT_HW_FLOW
            #if defined UART2_MANUAL_RTS_CONTROL
        case UART_RTS_RS485_MANUAL_MODE:
            return 1;                                                    // this UART's RTS line is manually controlled in RS485 mode
            #endif
            #if defined UART_WITHOUT_MODEM_CONTROL || defined UART2_MANUAL_RTS_CONTROL
        case UART_RTS_PIN_ASSERT:
            if (ucRTS_neg[2] == 0) {
                _SET_RTS_2_HIGH();
            }
            else {
                _SET_RTS_2_LOW();
            }
            break;
        case UART_RTS_PIN_NEGATE:
            if (ucRTS_neg[2] == 0) {
                _SET_RTS_2_LOW();
            }
            else {
                _SET_RTS_2_HIGH();
            }
            break;
            #endif

        case UART_RTS_PIN_INVERTED:
        case UART_RTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL || defined UART2_MANUAL_RTS_CONTROL
            if (iPinReference != UART_RTS_PIN_INVERTED) {
                _CONFIGURE_RTS_2_LOW();                                  // configure RTS output and set to '0'
                ucRTS_neg[2] = 0;                                        // not inverted RTS mode
            }
            else {
                _CONFIGURE_RTS_2_HIGH();                                 // configure RTS output and set to '1'
                ucRTS_neg[2] = 1;                                        // inverted RTS mode
            }
            #elif (defined KINETIS_K61 || defined KINETIS_K70 || defined KINETIS_K21 || defined KINETIS_KW2X) && defined UART2_ON_E // {25}
            _CONFIG_PERIPHERAL(E, 19, (PE_19_UART2_RTS | UART_PULL_UPS));// UART2_RTS on PE19 (alt. function 3)
            #elif (defined KINETIS_K61 || defined KINETIS_K70) && defined UART2_ON_F // {25}
            _CONFIG_PERIPHERAL(F, 11, (PF_11_UART2_RTS | UART_PULL_UPS));// UART2_RTS on PF11 (alt. function 4)
            #else
            _CONFIG_PERIPHERAL(D, 0, (PD_0_UART2_RTS | UART_PULL_UPS));  // UART2_RTS on PD0 (alt. function 3)
            #endif
            break;

        case UART_CTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL
            #elif (defined KINETIS_K61 || defined KINETIS_K70 || defined KINETIS_K21 || defined KINETIS_KW2X) && defined UART2_ON_E // {25}
            _CONFIG_PERIPHERAL(E, 18, (PE_18_UART2_CTS | UART_PULL_UPS));// UART2_CTS on PE18 (alt. function 3)
            #elif (defined KINETIS_K61 || defined KINETIS_K70) && defined UART2_ON_F // {25}
            _CONFIG_PERIPHERAL(F, 12, (PF_12_UART2_CTS | UART_PULL_UPS));// UART2_CTS on PF12 (alt. function 4)
            #else
            _CONFIG_PERIPHERAL(D, 1, (PD_1_UART2_CTS | UART_PULL_UPS));  // UART2_CTS on PD1 (alt. function 3)
            #endif
            break;
        #endif
        }
        break;
    #endif

    #if defined FOURTH_UART_CHANNEL
    case FOURTH_UART_CHANNEL:
        switch (iPinReference) {
        case UART_TX_PIN:                                                // UART3 tx pin configuration
        #if defined UART3_ON_B
            _CONFIG_PERIPHERAL(B, 11, (PB_11_UART3_TX | UART_PULL_UPS)); // UART3_TX on PB11 (alt. function 3)
        #elif defined UART3_ON_C
            _CONFIG_PERIPHERAL(C, 17, (PC_17_UART3_TX | UART_PULL_UPS)); // UART3_TX on PC17 (alt. function 3)
        #elif (defined KINETIS_K61 || defined KINETIS_K70) && defined UART3_ON_F // {25}
            _CONFIG_PERIPHERAL(F, 8, (PF_8_UART3_TX | UART_PULL_UPS));   // UART3_TX on PF8 (alt. function 4) {12}
        #else
            _CONFIG_PERIPHERAL(E, 4, (PE_4_UART3_TX | UART_PULL_UPS));   // UART3_TX on PE4 (alt. function 3)
        #endif
        #if defined irq_UART2_3_ID
            iInterruptID = irq_UART2_3_ID;                               // UART2/3 transmitter/receiver shared interrupt vector ID
        #else
            iInterruptID = irq_UART3_ID;                                 // UART3 transmitter/receiver interrupt vector ID
        #endif
            ucPriority = PRIORITY_UART3;
            InterruptFunc = _SCI3_Interrupt;
            break;

