sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
        case UART_RX_PIN:                                                // UART3 rx pin configuration
        #if defined irq_UART2_3_ID
            iInterruptID = irq_UART2_3_ID;                               // UART2/3 transmitter/receiver shared interrupt vector ID
        #else
            iInterruptID = irq_UART3_ID;                                 // UART3 transmitter/receiver interrupt vector ID
        #endif
            ucPriority = PRIORITY_UART3;
            InterruptFunc = _SCI3_Interrupt;
        #if defined UART_ERROR_INTERRUPT_VECTOR                          // {1}
            InterruptErrorFunc = _SCI3_Error_Interrupt;
            ucErrorPriority = PRIORITY_ERROR_UART3;
        #endif
            if ((UART3_C1 & UART_C1_LOOPS) != 0) {                       // loop-back/single-wire mode doesn't configure/use the UARTx_Rx pin
                break;
            }
        #if defined UART3_ON_B
            _CONFIG_PERIPHERAL(B, 10, (PB_10_UART3_RX | UART_PULL_UPS)); // UART3_RX on PB10 (alt. function 3)
        #elif defined UART3_ON_C
            _CONFIG_PERIPHERAL(C, 16, (PC_16_UART3_RX | UART_PULL_UPS)); // UART3_RX on PC16 (alt. function 3)
        #elif (defined KINETIS_K61 || defined KINETIS_K70) && defined UART3_ON_F // {25}
            _CONFIG_PERIPHERAL(F, 7, (PF_7_UART3_RX | UART_PULL_UPS));   // UART3_RX on PF7 (alt. function 4) {12}
        #else
            _CONFIG_PERIPHERAL(E, 5, (PE_5_UART3_RX | UART_PULL_UPS));   // UART3_RX on PE5 (alt. function 3)
        #endif
            break;

        #if defined SUPPORT_HW_FLOW
            #if defined UART3_MANUAL_RTS_CONTROL
        case UART_RTS_RS485_MANUAL_MODE:
            return 1;                                                    // this UART's RTS line is manually controlled in RS485 mode
            #endif
            #if defined UART_WITHOUT_MODEM_CONTROL
        case UART_RTS_PIN_ASSERT:
            if (ucRTS_neg[3] == 0) {
                _SET_RTS_3_HIGH();
            }
            else {
                _SET_RTS_3_LOW();
            }
            break;
        case UART_RTS_PIN_NEGATE:
            if (ucRTS_neg[3] == 0) {
                _SET_RTS_3_LOW();
            }
            else {
                _SET_RTS_3_HIGH();
            }
            break;
            #endif

        case UART_RTS_PIN_INVERTED:
        case UART_RTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL
            if (iPinReference != UART_RTS_PIN_INVERTED) {
                _CONFIGURE_RTS_3_LOW();                                  // configure RTS output and set to '0'
                ucRTS_neg[3] = 0;                                        // not inverted RTS mode
            }
            else {
                _CONFIGURE_RTS_3_HIGH();                                 // configure RTS output and set to '1'
                ucRTS_neg[3] = 1;                                        // inverted RTS mode
            }
            #elif defined UART3_ON_B
            _CONFIG_PERIPHERAL(B, 8, (PB_8_UART3_RTS | UART_PULL_UPS));  // UART3_RTS on PB8 (alt. function 3)
            #elif defined UART3_ON_C
            _CONFIG_PERIPHERAL(C, 18, (PC_18_UART3_RTS | UART_PULL_UPS));// UART3_RTS on PC18 (alt. function 3)
            #elif (defined KINETIS_K61 || defined KINETIS_K70) && defined UART3_ON_F // {25}
            _CONFIG_PERIPHERAL(F, 9, (PF_9_UART3_RTS | UART_PULL_UPS));  // UART3_RTS on PF9 (alt. function 4) {12}
            #else
            _CONFIG_PERIPHERAL(E, 7, (PE_7_UART3_RTS | UART_PULL_UPS));  // UART3_RTS on PE7 (alt. function 3)
            #endif
            break;

        case UART_CTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL
            #elif defined UART3_ON_B
            _CONFIG_PERIPHERAL(B, 9, (PB_9_UART3_CTS | UART_PULL_UPS)); // UART3_CTS on PB9 (alt. function 3)
            #elif defined UART3_ON_C
            _CONFIG_PERIPHERAL(C, 19, (PC_19_UART3_CTS | UART_PULL_UPS));// UART3_CTS on PC19 (alt. function 3)
            #elif (defined KINETIS_K61 || defined KINETIS_K70) && defined UART3_ON_F // {25}
            _CONFIG_PERIPHERAL(F, 10, (PF_10_UART3_CTS | UART_PULL_UPS));// UART3_CTS on PF10 (alt. function 4) {12}
            #else
            _CONFIG_PERIPHERAL(E, 6, (PE_6_UART3_CTS | UART_PULL_UPS));  // UART3_CTS on PE6 (alt. function 3)
            #endif
            break;
        #endif
        }
        break;
    #endif

    #if defined FIFTH_UART_CHANNEL
    case FIFTH_UART_CHANNEL:
        switch (iPinReference) {
        case UART_TX_PIN:                                                // UART4 tx pin configuration
        #if defined UART4_ON_C
            _CONFIG_PERIPHERAL(C, 15, (PC_15_UART4_TX | UART_PULL_UPS)); // UART4_TX on PC15 (alt. function 3)
        #else
            _CONFIG_PERIPHERAL(E, 24, (PE_24_UART4_TX | UART_PULL_UPS)); // UART4_TX on PE24 (alt. function 3)
        #endif
            iInterruptID = irq_UART4_ID;                                 // UART4 transmitter/receiver interrupt vector ID
            ucPriority = PRIORITY_UART4;
            InterruptFunc = _SCI4_Interrupt;
            break;

        case UART_RX_PIN:                                                // UART4 rx pin configuration
            iInterruptID = irq_UART4_ID;                                 // UART4 transmitter/receiver interrupt vector ID
            ucPriority = PRIORITY_UART4;
            InterruptFunc = _SCI4_Interrupt;
        #if defined UART_ERROR_INTERRUPT_VECTOR                          // {1}
            InterruptErrorFunc = _SCI4_Error_Interrupt;
            ucErrorPriority = PRIORITY_ERROR_UART4;
        #endif
            if ((UART4_C1 & UART_C1_LOOPS) != 0) {                       // loop-back/single-wire mode doesn't configure/use the UARTx_Rx pin
                break;
            }
        #if defined UART4_ON_C
            _CONFIG_PERIPHERAL(C, 14, (PC_14_UART4_RX | UART_PULL_UPS)); // UART4_RX on PC14 (alt. function 3)
        #else
            _CONFIG_PERIPHERAL(E, 25, (PE_25_UART4_RX | UART_PULL_UPS)); // UART4_RX on PE25 (alt. function 3)
        #endif
            break;

        #if defined SUPPORT_HW_FLOW
            #if defined UART4_MANUAL_RTS_CONTROL
        case UART_RTS_RS485_MANUAL_MODE:
            return 1;                                                    // this UART's RTS line is manually controlled in RS485 mode
            #endif
            #if defined UART_WITHOUT_MODEM_CONTROL
        case UART_RTS_PIN_ASSERT:
            if (ucRTS_neg[4] == 0) {
                _SET_RTS_4_HIGH();
            }
            else {
                _SET_RTS_4_LOW();
            }
            break;
        case UART_RTS_PIN_NEGATE:
            if (ucRTS_neg[4] == 0) {
                _SET_RTS_4_LOW();
            }
            else {
                _SET_RTS_4_HIGH();
            }
            break;
            #endif

        case UART_RTS_PIN_INVERTED:
        case UART_RTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL
            if (iPinReference != UART_RTS_PIN_INVERTED) {
                _CONFIGURE_RTS_4_LOW();                                  // configure RTS output and set to '0'
                ucRTS_neg[4] = 0;                                        // not inverted RTS mode
            }
            else {
                _CONFIGURE_RTS_4_HIGH();                                 // configure RTS output and set to '1'
                ucRTS_neg[4] = 1;                                        // inverted RTS mode
            }
            #elif defined UART4_ON_C
            _CONFIG_PERIPHERAL(C, 12, (PC_12_UART4_RTS | UART_PULL_UPS));// UART4_RTS on PC12 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(E, 27, (PE_27_UART4_RTS | UART_PULL_UPS));// UART4_RTS on PE27 (alt. function 3)
            #endif
            break;

        case UART_CTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL
            #elif defined UART4_ON_C
            _CONFIG_PERIPHERAL(C, 13, (PC_13_UART4_CTS | UART_PULL_UPS));// UART4_CTS on PC13 (alt. function 3)
            #else
            _CONFIG_PERIPHERAL(E, 26, (PE_26_UART4_CTS | UART_PULL_UPS));// UART4_CTS on PE26 (alt. function 3)
            #endif
            break;
        #endif
        }
        break;
    #endif

    #if defined SIXTH_UART_CHANNEL
    case SIXTH_UART_CHANNEL:
        switch (iPinReference) {
        case UART_TX_PIN:                                                // UART5 tx pin configuration
        #if defined UART5_ON_D
            _CONFIG_PERIPHERAL(D, 9, (PD_9_UART5_TX | UART_PULL_UPS));   // UART5_TX on PD9 (alt. function 3)
        #else
            _CONFIG_PERIPHERAL(E, 8, (PE_8_UART5_TX | UART_PULL_UPS));   // UART5_TX on PE8 (alt. function 3)
        #endif
            iInterruptID = irq_UART5_ID;                                 // UART5 transmitter/receiver interrupt vector ID
            ucPriority = PRIORITY_UART5;
            InterruptFunc = _SCI5_Interrupt;
            break;

