sWahlinRhoades/uTaskerModified/Hardware/Kinetis/kinetis_uart_pins.h
        case UART_RX_PIN:                                                // UART5 rx pin configuration
            iInterruptID = irq_UART5_ID;                                 // UART5 transmitter/receiver interrupt vector ID
            ucPriority = PRIORITY_UART5;
            InterruptFunc = _SCI5_Interrupt;
        #if defined UART_ERROR_INTERRUPT_VECTOR                          // {1}
            InterruptErrorFunc = _SCI5_Error_Interrupt;
            ucErrorPriority = PRIORITY_ERROR_UART5;
        #endif
            if ((UART5_C1 & UART_C1_LOOPS) != 0) {                       // loop-back/single-wire mode doesn't configure/use the UARTx_Rx pin
                break;
            }
        #if defined UART5_ON_D
            _CONFIG_PERIPHERAL(D, 8, (PD_8_UART5_RX | UART_PULL_UPS));   // UART5_RX on PD8 (alt. function 3)
        #else
            _CONFIG_PERIPHERAL(E, 9, (PE_9_UART5_RX | UART_PULL_UPS));   // UART5_RX on PE9 (alt. function 3)
        #endif
            break;

        #if defined SUPPORT_HW_FLOW
            #if defined UART5_MANUAL_RTS_CONTROL
        case UART_RTS_RS485_MANUAL_MODE:
            return 1;                                                    // this UART's RTS line is manually controlled in RS485 mode
            #endif
            #if defined UART_WITHOUT_MODEM_CONTROL
        case UART_RTS_PIN_ASSERT:
            if (ucRTS_neg[5] == 0) {
                _SET_RTS_5_HIGH();
            }
            else {
                _SET_RTS_5_LOW();
            }
            break;
        case UART_RTS_PIN_NEGATE:
            if (ucRTS_neg[5] == 0) {
                _SET_RTS_5_LOW();
            }
            else {
                _SET_RTS_5_HIGH();
            }
            break;
            #endif

        case UART_RTS_PIN_INVERTED:
        case UART_RTS_PIN:
            #if defined UART_WITHOUT_MODEM_CONTROL
            if (iPinReference != UART_RTS_PIN_INVERTED) {
                _CONFIGURE_RTS_5_LOW();                                  // configure RTS output and set to '0'
                ucRTS_neg[5] = 0;                                        // not inverted RTS mode
            }
            else {
                _CONFIGURE_RTS_5_HIGH();                                 // configure RTS output and set to '1'
                ucRTS_neg[5] = 1;                                        // inverted RTS mode
            }
            #elif defined UART5_ON_D
            _CONFIG_PERIPHERAL(D, 10, (PD_10_UART5_RTS | UART_PULL_UPS));// UART5_RTS on PD10 (alt. function 3)
            #else
                #if UARTS_AVAILABLE == 5
                    #if defined LPUART0_ON_A
            _CONFIG_PERIPHERAL(A, 3, (PA_3_LPUART0_RTS | UART_PULL_UPS));// LPUART0_RTS on PA3 (alt. function 5)
                    #elif defined LPUART0_ON_D
            _CONFIG_PERIPHERAL(D, 10, (PD_10_LPUART0_RTS | UART_PULL_UPS)); // LPUART0_RTS on PD10 (alt. function 5)
                    #else
            _CONFIG_PERIPHERAL(E, 11, (PE_11_LPUART0_RTS | UART_PULL_UPS)); // LPUART0_RTS on PE11 (alt. function 5)
                    #endif
                #else
            _CONFIG_PERIPHERAL(E, 11, (PE_11_UART5_RTS | UART_PULL_UPS));// UART5_RTS on PE11 (alt. function 3)
                #endif
            #endif
            break;

        case UART_CTS_PIN:
            #if defined UART5_ON_D
            _CONFIG_PERIPHERAL(D, 11, (PD_11_UART5_CTS | UART_PULL_UPS)); // UART5_CTS on PD11 (alt. function 3)
            #else
                #if UARTS_AVAILABLE == 5
                    #if defined LPUART0_ON_A
            _CONFIG_PERIPHERAL(A, 0, (PA_0_LPUART0_CTS | UART_PULL_UPS)); // LPUART0_CTS on PA0 (alt. function 5)
                    #elif defined LPUART0_ON_D
            _CONFIG_PERIPHERAL(D, 11, (PD_11_LPUART0_CTS | UART_PULL_UPS)); // LPUART0_CTS on PD11 (alt. function 5)
                    #else
            _CONFIG_PERIPHERAL(E, 10, (PE_10_LPUART0_CTS | UART_PULL_UPS)); // LPUART0_CTS on PE10 (alt. function 5)
                    #endif
                #else
            _CONFIG_PERIPHERAL(E, 10, (PE_10_UART5_CTS | UART_PULL_UPS)); // UART5_CTS on PE10 (alt. function 3)
                #endif
            #endif
            break;
        #endif
        }
        break;
    #endif

    default:
        _EXCEPTION("UART doesn't exist!!");
        return 0;
    }

    if (InterruptFunc != 0) {                                            // if the interrupt handler is to be installed
        fnEnterInterrupt(iInterruptID, ucPriority, InterruptFunc);       // enter UART/LPUART interrupt handler
    #if defined UART_ERROR_INTERRUPT_VECTOR                              // {1}
        if (InterruptErrorFunc != 0) {
            fnEnterInterrupt((iInterruptID + 1), ucErrorPriority, InterruptErrorFunc); // enter UART error interrupt handler
        }
    #endif
    }
    return 0;
}
